---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.GetApplicableDemandFactor(System.Double)
source: html/3ed202d6-0aae-32ec-5b02-50ac0274728b.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.GetApplicableDemandFactor Method

This method will return the applicable demand factor for the specified number
 of devices or load.

## Syntax (C#)
```csharp
public double GetApplicableDemandFactor(
	double numberOrLoad
)
```

## Parameters
- **numberOrLoad** (`System.Double`) - The number of devices or load for which the demand factor should be looked up.

## Returns
The applicable demand factor.